timothybrown/TivaWare_GCC/cc3000/src/spi/spi-tm4c129.c
//*****************************************************************************
//
// spi.c - CC3000 Host Driver Implementation for Tiva TM4C129 devices.
//
// Copyright (c) 2014-2015 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.1.71 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_types.h"
#include "inc/hw_memmap.h"
#include "inc/hw_ints.h"
#include "inc/hw_nvic.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_ssi.h"
#include "driverlib/debug.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/pin_map.h"
#include "driverlib/ssi.h"
#include "driverlib/udma.h"
#include "hci.h"
#include "spi.h"
#include "board.h"

//*****************************************************************************
//
// The size of the DMA channel control structure we need in bytes.
//
//*****************************************************************************
#define DMA_CHANNEL_CONTROL_STRUCTURE_SIZE  (512)

//*****************************************************************************
//
// Various labels and macros used in parsing the SPI packet header.
//
//*****************************************************************************
#define READ                    3
#define WRITE                   1
#define HI(value)               (((value) & 0xFF00) >> 8)
#define LO(value)               ((value) & 0xFF)
#define HEADERS_SIZE_EVNT       (SPI_HEADER_SIZE + 5)
#define SPI_HEADER_SIZE         (5)

//*****************************************************************************
//
// SPI transaction states.
//
//*****************************************************************************
#define eSPI_STATE_POWERUP              (0)
#define eSPI_STATE_INITIALIZED          (1)
#define eSPI_STATE_IDLE                 (2)
#define eSPI_STATE_WRITE_IRQ            (3)
#define eSPI_STATE_WRITE_FIRST_PORTION  (4)
#define eSPI_STATE_WRITE_EOT            (5)
#define eSPI_STATE_READ_IRQ             (6)
#define eSPI_STATE_READ_FIRST_PORTION   (7)
#define eSPI_STATE_READ_EOT             (8)

//*****************************************************************************
//
// SPI interface hardware parameters.
//
//*****************************************************************************
typedef struct
{
    uint32_t ui32PioPortAddress;
    uint32_t ui32PioSpiPort;
    uint32_t ui32PioSpiCs;
    uint32_t ui32PortInt;
    uint32_t ui32PioSlEnable;

    uint32_t ui32DMAPort;
    uint32_t ui32DMARxChannel;
    uint32_t ui32DMATxChannel;

    uint32_t ui32SsiPort;
    uint32_t ui32SsiPortAddress;
    uint32_t ui32SsiTx;
    uint32_t ui32SsiRx;
    uint32_t ui32SsiClck;
    uint32_t ui32SsiPortInt;
}tSpiHwConfiguration;

//*****************************************************************************
//
// SPI connection and transaction state information.
//
//*****************************************************************************
typedef struct
{
    tSpiHandleRx SPIRxHandler;

    uint16_t ui16TxPacketLength;
    uint16_t ui16RxPacketLength;
    volatile uint32_t ui32SpiState;
    uint8_t *pTxPacket;
    uint8_t *pRxPacket;
    uint32_t ui32RxBufferSize;
    tSpiHwConfiguration sHwSettings;
}tSpiInformation;

tSpiInformation sSpiInformation;

//*****************************************************************************
//
// A couple of bytes used as a dummy source when receiving SSI data from the
// CC3000 or as a dummy destination when transmitting to the CC3000.
//
//*****************************************************************************
uint8_t g_pui8Dummy[2] = {0, 0x5A};

//*****************************************************************************
//
// The number of bytes read at the start of every receive transaction.  This
// contains the outer SPI packet header and the header of the contained HCI
// packet.
//
//*****************************************************************************
#define PACKET_HEADER_LEN 10

//*****************************************************************************
//
// Define the transmit and receive buffers along with the control structure
// table for the DMA engine.  Unfortunately, C99 doesn't provide us with a
// standard method of dictating the alignment of variables or indicating that
// an array should not be initialized so we need some compiler-specific
// syntax here.
//
//*****************************************************************************

//
// Case for Code Composer Studio.
//
#if defined(__CCS__) || defined(ccs)
uint8_t wlan_rx_buffer[CC3000_RX_BUFFER_SIZE];
uint8_t wlan_tx_buffer[CC3000_TX_BUFFER_SIZE];
uint8_t chBuffer[CC3000_RX_BUFFER_SIZE];
#pragma DATA_ALIGN(ucDMAChannelControlStructure, 1024);
static uint8_t ucDMAChannelControlStructure[DMA_CHANNEL_CONTROL_STRUCTURE_SIZE];

//
// Case for IAR Embedded Workbench for ARM (ewarm).
//
#elif defined(__IAR_SYSTEMS_ICC__) || defined(ewarm)
__no_init uint8_t wlan_rx_buffer[CC3000_RX_BUFFER_SIZE];
__no_init uint8_t wlan_tx_buffer[CC3000_TX_BUFFER_SIZE];
__no_init uint8_t chBuffer[CC3000_RX_BUFFER_SIZE];
#pragma data_alignment=1024
__no_init static uint8_t ucDMAChannelControlStructure[DMA_CHANNEL_CONTROL_STRUCTURE_SIZE];

//
// Case for Sourcery CodeBench, GCC, and Keil RVMDK.
//
#else
uint8_t wlan_rx_buffer[CC3000_RX_BUFFER_SIZE];
uint8_t wlan_tx_buffer[CC3000_TX_BUFFER_SIZE];
uint8_t chBuffer[CC3000_RX_BUFFER_SIZE];
static uint8_t ucDMAChannelControlStructure[DMA_CHANNEL_CONTROL_STRUCTURE_SIZE] __attribute__ ((aligned(1024)));
#endif

//*****************************************************************************
//
// An array containing the 10 bytes we need to send to the CC3000 when reading
// a response header from it.
//
//*****************************************************************************
uint8_t tSpiReadHeader[] = {READ, 0, 0, 0, 0, 0, 0, 0, 0, 0};

//*****************************************************************************
//
// Internal function prototypes.
//
//*****************************************************************************
static void SpiWriteDataSynchronous(const uint8_t *pui8Data,
                                    uint16_t ui16Size);
static void SpiWriteAsync(const uint8_t *pui8Data, uint16_t ui16Size);
static void SpiReadData(uint8_t *pui8Data, uint16_t ui16Size);
static void SpiDisableInterrupts(void);

//*****************************************************************************
//
// Initialize the hardware settings for the SPI and IRQ interface between
// the TM4C and CC3000.  The labels used here can be found in the relevant
// version of board.h for the intended target board.
//
//*****************************************************************************
void
SpiConfigureHwMapping(void)
{
    sSpiInformation.sHwSettings.ui32PioPortAddress = SYSCTL_PERIPH_SPI_PORT;
    sSpiInformation.sHwSettings.ui32PioSpiCs   = SPI_CS_PIN;
    sSpiInformation.sHwSettings.ui32PioSpiPort = SPI_PORT;
    sSpiInformation.sHwSettings.ui32DMAPort   = SYSCTL_PERIPH_UDMA;
    sSpiInformation.sHwSettings.ui32PortInt    = INT_GPIO_SPI;
    sSpiInformation.sHwSettings.ui32SsiPortAddress = SYSCTL_PERIPH_SPI;
    sSpiInformation.sHwSettings.ui32SsiTx = SPI_TX_PIN;
    sSpiInformation.sHwSettings.ui32SsiRx = SPI_RX_PIN;
    sSpiInformation.sHwSettings.ui32SsiClck = SPI_CLK_PIN;
    sSpiInformation.sHwSettings.ui32SsiPort = SPI_BASE;
    sSpiInformation.sHwSettings.ui32SsiPortInt = INT_SPI;
    sSpiInformation.sHwSettings.ui32DMARxChannel = SPI_UDMA_RX_CHANNEL;
    sSpiInformation.sHwSettings.ui32DMATxChannel = SPI_UDMA_TX_CHANNEL;
}

//*****************************************************************************
//
// Read and clear the status of the interrupt from the CC3000 to TM4C.
//
//*****************************************************************************
uint32_t
SpiCleanGPIOISR(void)
{
    uint32_t ui32Status;

    //
    // Get the reason for the interrupt
    //
    ui32Status = MAP_GPIOIntStatus(SPI_GPIO_IRQ_BASE, true);

    //
    // Clear any asserted interrupts
    //
    MAP_GPIOIntClear(SPI_GPIO_IRQ_BASE, ui32Status);

    //
    // Return the read status to the caller.
    //
    return(ui32Status);
}

//*****************************************************************************
//
// Configure the TM4C SPI interface connecting to the CC3000 and the DMA
// channels used to send and receive data.
//
//*****************************************************************************
static void
SpiConfigure(uint32_t ui32SSIFreq, uint32_t ui32SysClck)
{

    //
    // Enable required SSI and GPIO peripherals.
    //
    MAP_SysCtlPeripheralEnable(sSpiInformation.sHwSettings.ui32PioPortAddress);
    MAP_SysCtlPeripheralEnable(sSpiInformation.sHwSettings.ui32SsiPortAddress);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_SPI_BASE);

    //
    // Set pin muxing to route the SPI signals to the relevant pins.
    //
    GPIOPinConfigure(SPI_CLK_MUX_SEL);
    GPIOPinConfigure(SPI_RX_MUX_SEL);
    GPIOPinConfigure(SPI_TX_MUX_SEL);

    //
    // Configure the appropriate pins to be SSI instead of GPIO
    //
    MAP_GPIOPinTypeSSI(sSpiInformation.sHwSettings.ui32PioSpiPort,
                       (sSpiInformation.sHwSettings.ui32SsiTx |
                        sSpiInformation.sHwSettings.ui32SsiRx |
                        sSpiInformation.sHwSettings.ui32SsiClck));

    //
    // Enable the uDMA peripheral.  This must be done before enabling DMA in
    // the SSI peripheral.
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);

    //
    // Enable the uDMA controller.
    //
    MAP_uDMAEnable();

    //
    // Configure and enable the SSI port for master mode
    //
    MAP_SysCtlPeripheralReset(sSpiInformation.sHwSettings.ui32SsiPortAddress);

    //
    // Ensure that the SSI is disabled before making any configuration
    // changes.
    //
    MAP_SSIDisable(sSpiInformation.sHwSettings.ui32SsiPort);

    //
    // Configure SSI with 8 bit data, Polarity '0', Phase '1' and clock
    // frequency as provided by the caller.
    //
    MAP_SSIConfigSetExpClk(sSpiInformation.sHwSettings.ui32SsiPort, ui32SysClck,
                           SSI_FRF_MOTO_MODE_1, SSI_MODE_MASTER,
                           ui32SSIFreq, 8);

    //
    // Enable the SSI now that configuration is complete.
    //
    MAP_SSIEnable(sSpiInformation.sHwSettings.ui32SsiPort);

    //
    // Configure the DMA channels for the selected SPI Module
    //
    MAP_uDMAChannelAssign( sSpiInformation.sHwSettings.ui32DMARxChannel);
    MAP_uDMAChannelAssign( sSpiInformation.sHwSettings.ui32DMATxChannel);

    //
    // Point at the control table to use for channel control structures
    //
    MAP_uDMAControlBaseSet(ucDMAChannelControlStructure);

    //
    // Put the attributes in a known state for the uDMA SSIRX channel.  These
    // should already be disabled by default.
    //
    MAP_uDMAChannelAttributeDisable(sSpiInformation.sHwSettings.ui32DMARxChannel,
                                    UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
                                    UDMA_ATTR_HIGH_PRIORITY |
                                    UDMA_ATTR_REQMASK);

    //
    // Configure the control parameters for the primary control structure for
    // the SSI RX channel. The transfer data size is 8 bits, the source
    // address does not increment since it will be reading from a register.
    // The destination address increment is byte 8-bit bytes. The arbitration
    // size is set to 1 to match the RX FIFO trigger threshold. The uDMA
    // controller will use a 4 byte burst transfer if possible.
    //
    MAP_uDMAChannelControlSet((sSpiInformation.sHwSettings.ui32DMARxChannel |
                               UDMA_PRI_SELECT), (UDMA_SIZE_8 |
                              UDMA_SRC_INC_NONE | UDMA_DST_INC_8 | UDMA_ARB_1));

    //
    // Put the attributes in a known state for the uDMA SSITX channel.  These
    // should already be disabled by default.
    //
    MAP_uDMAChannelAttributeDisable(sSpiInformation.sHwSettings.ui32DMATxChannel,
                                    UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
                                    UDMA_ATTR_HIGH_PRIORITY |
                                    UDMA_ATTR_REQMASK);

    //
    // Configure the control parameters for the SSI TX.  The uDMA SSI TX
    // channel is used to transfer a block of data from a buffer to the SSI.
    // The data size is 8 bits.  The source address increment is 8-bit bytes
    // since the data is coming from a buffer.  The destination increment is
    // none since the data is to be written to the SSI data register.  The
    // arbitration size is set to 4, which matches the SSI TX FIFO trigger
    // threshold.
    //
    MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.ui32DMATxChannel |
                              UDMA_PRI_SELECT, UDMA_SIZE_8 | UDMA_SRC_INC_8 |
                              UDMA_DST_INC_NONE | UDMA_ARB_4);

    //
    // Now both the uDMA SSI TX and RX channels are primed to start a
    // transfer.  As soon as the channels are enabled, the peripheral will
    // issue a transfer request and the data transfers will begin.  Make
    // sure the channels are disabled now, though.
    //
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.ui32DMARxChannel);
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.ui32DMATxChannel);
}

//*****************************************************************************
//
// Close the SPI connection to the CC3000 by disabling all interrupts used in
// the communication.
//
//*****************************************************************************
void
SpiClose(void)
{
    if (sSpiInformation.pRxPacket)
    {
        sSpiInformation.pRxPacket = 0;
    }

    //
    //  Disable the interrupt from the IRQ GPIO input.
    //
    tSLInformation.WlanInterruptDisable();

    //
    // Disable interrupt for SPI IRQ and SSI module.
    //
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32PortInt);
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32SsiPortInt);
}

//*****************************************************************************
//
// Open the SPI driver.  Before calling this function, it is assumed that the
// SPI peripheral has been configured via a call to init_spi().  On exit,
// interrupts from SPI and the CC3000 IRQ GPIO pin are enabled.
//
//*****************************************************************************
void
SpiOpen(tSpiHandleRx pfnRxHandler)
{
    //
    // Parameter sanity check.
    //
    ASSERT(pfnRxHandler);

    //
    // Set the initial state to indicate that we need to wait for the power-up
    // handshake from the CC3000.
    //
    sSpiInformation.ui32SpiState = eSPI_STATE_POWERUP;

    //
    // Remember our receive callback handler function pointer.
    //
    sSpiInformation.SPIRxHandler = pfnRxHandler;

    //
    // Initialize buffer-related fields.
    //
    sSpiInformation.ui16TxPacketLength = 0;
    sSpiInformation.pTxPacket = NULL;
    sSpiInformation.pRxPacket = wlan_rx_buffer;
    sSpiInformation.ui16RxPacketLength = 0;
    sSpiInformation.ui32RxBufferSize = CC3000_RX_BUFFER_SIZE;

    //
    // Enable the interrupt from the CC3000 IRQ.
    //
    tSLInformation.WlanInterruptEnable();

    //
    // Enable the IRQ and SPI interrupts in the NVIC.
    //
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32PortInt);
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32SsiPortInt);
}

//*****************************************************************************
//
// Configure the SPI peripheral to use the frequency specified in ui32SSIFreq
// and set up pin muxing as required for the SPI signals and CC3000 IRQ GPIO.
//
//*****************************************************************************
int init_spi(uint32_t ui32SSIFreq, uint32_t ui32SysClck)
{
    //
    // Configure the hardware to use the required SPI and GPIO peripherals.
    //
    SpiConfigureHwMapping();

    //
    // Set SPI interface configuration parameters.
    //
    SpiConfigure(ui32SSIFreq, ui32SysClck);

