timothybrown/TivaWare_GCC/cc3000/src/spi/spi-tm4c129.c
    return(ESUCCESS);
}

//*****************************************************************************
//
// Determine whether or not a DMA transaction on a given channel is currently
// ongoing.  The function returns false if the DMA channel is enabled and,
// hence, the transaction is still ongoing, or true if the channel is disabled
// and no transaction is in progress.
//
//*****************************************************************************
static bool
SpiIsDMAStopped(long ch)
{
    return(MAP_uDMAChannelIsEnabled(ch) ? false : true);
}

//*****************************************************************************
//
// Flush any data which may exist in the SPI peripheral's receive FIFO.
//
//*****************************************************************************
static void
SpiFlushRxFifo(void)
{
    uint32_t ui32Idx;

    while(MAP_SSIDataGetNonBlocking(sSpiInformation.sHwSettings.ui32SsiPort,
                                    &ui32Idx))
    {
        //
        // Keep reading until there's no data left to read.
        //
    }

    //
    //Clear the RX overrun interrupt flag.
    //
    SSIIntClear(sSpiInformation.sHwSettings.ui32SsiPort, SSI_RXOR);
}

//*****************************************************************************
//
// This function is called to write the first SPI packet to the CC3000 after
// it is enabled.  This packet uses a somewhat different protocol from all
// others, requiring delays be inserted after asserting CS and between the 4th
// and 5th bytes of the packet. Also, the IRQ line from the CC3000 is not used
// as a signal to start transmission in this case.
//
// pui8Buf points to the data to be sent to the CC3000 and ui16Length is the
// number of bytes to send.
//
// The function always returns 0.
//
//*****************************************************************************
uint32_t
SpiFirstWrite(uint8_t *pui8Buf, uint16_t ui16Length)
{
    //
    // Assert the chip select to CC3000.
    //
    ASSERT_CS();

    //
    // Wait 80 microseconds.
    //
    SysCtlDelay((DELAY_50_MICROSECONDS * 8) / 5);

    //
    // Write the first 4 bytes of the packet we have been provided.
    //
    SpiWriteDataSynchronous(pui8Buf, 4);

    //
    // Wait for the transmission to complete.
    //
    while(SSIBusy(SPI_BASE))
    {
        //
        // Spin...
        //
    }

    //
    // Generate an 80 microsecond gap between the last byte sent and the
    // remainder of the packet.
    //
    SysCtlDelay((DELAY_50_MICROSECONDS * 8) / 5);

    //
    // Send the remaining bytes in the packet.
    //
    SpiWriteDataSynchronous(pui8Buf + 4, ui16Length - 4);

    //
    // We're done.  Switch the state to IDLE so that future transmissions
    // follow the usual convention of waiting for IRQ to become active before
    // starting to send data.
    //
    sSpiInformation.ui32SpiState = eSPI_STATE_IDLE;

    //
    // Wait for the remainder of the packet transmission to complete.
    //
    while(SSIBusy(SPI_BASE));

    //
    // Pull CS high again to indicate the end of the packet.
    //
    DEASSERT_CS();

    return(0);
}

//*****************************************************************************
//
// Write a packet to the CC3000 via SPI.
//
// This function writes the buffer identified by pui8UserBuffer and ui16Length
// to the CC3000 via the configured SPI connection.  The buffer passed is
// assumed to contain an uninitialized, 5 byte SPI header prior to the
// application- provided packet data.
//
// pui8UserBuffer must contain an even number of bytes. If the supplied packet
// length is odd, an additional byte of padding is added to the end of the
// transmitted packet. pui8UserBuffer must, therefore, allow the driver to read
// 1 byte past the length supplied in ui16Length if this value is odd.
//
// Packets are written synchronously - this function does not return until all
// packet data has been sent.  Remember that packet transmission involves a
// handshake between the CS signal and the IRQ from CC3000 so we don't actually
// start transmission inside this function except in the case of the very first
// write which is handled differently.  For all packets other than the first,
// transmission actually starts in the GPIO interrupt handler for the CC3000
// IRQ line, IntSpiGPIOHandler().
//
//*****************************************************************************
long
SpiWrite(uint8_t *pui8UserBuffer, uint16_t ui16Length)
{
    uint8_t ucPad = 0;

    //
    // Parameter sanity check.
    //
    ASSERT(pui8UserBuffer);
    ASSERT(ui16Length);

    //
    // Figure out the total length of the packet in order to determine if
    // there is padding or not.
    //
    if(!(ui16Length & 0x0001))
    {
        ucPad++;
    }

    pui8UserBuffer[0] = WRITE;
    pui8UserBuffer[1] = HI(ui16Length + ucPad);
    pui8UserBuffer[2] = LO(ui16Length + ucPad);
    pui8UserBuffer[3] = 0;
    pui8UserBuffer[4] = 0;

    ui16Length += (SPI_HEADER_SIZE + ucPad);

    if (sSpiInformation.ui32SpiState == eSPI_STATE_POWERUP)
    {
        while (sSpiInformation.ui32SpiState != eSPI_STATE_INITIALIZED);
    }

    if (sSpiInformation.ui32SpiState == eSPI_STATE_INITIALIZED)
    {
        //
        // This is the first SPI transmission so we need to use special timing.
        //
        SpiFirstWrite(pui8UserBuffer, ui16Length);
    }
    else
    {
        //
        // We need wait until the device is idle to prevent us from trying to
        // transmit a packet when a packet receive may be ongoing.
        //
        while (sSpiInformation.ui32SpiState != eSPI_STATE_IDLE)
        {
            //
            // Keep spinning.
            //
        }

        //
        // Remember the location and size of the data we need to send.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_WRITE_IRQ;
        sSpiInformation.pTxPacket = pui8UserBuffer;
        sSpiInformation.ui16TxPacketLength = ui16Length;

        //
        // Assert the CS line and wait till SSI IRQ line is active and then
        // start the actual write operation.
        //
        ASSERT_CS();
    }

    //
    // Wait for the transaction to complete before returning.
    //
    while (eSPI_STATE_IDLE != sSpiInformation.ui32SpiState)
    {
        //
        // Kill time waiting for the transaction to complete
        //
    }

    return(0);
}

//*****************************************************************************
//
// Disable the SSI receive and transmit DMA channels.  To work around an
// erratum in TM4C129, this function also disables the associated DMA control
// in the SSI peripheral.
//
//*****************************************************************************
static void
SpiDisableSSIDMAChannels(void)
{
    //
    // Disable DMA mode in the SPI peripheral for transmit and receive.
    //
    MAP_SSIDMADisable(sSpiInformation.sHwSettings.ui32SsiPort,
                      SSI_DMA_TX | SSI_DMA_RX);

    //
    // Disable the transmit DMA channel.
    //
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.ui32DMATxChannel);

    //
    // Disable the receive DMA channel.
    //
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.ui32DMARxChannel);
}

//*****************************************************************************
//
// Enable the SSI receive and transmit DMA channels.  To work around an
// erratum in TM4C129, this function also enables the associated DMA control
// in the SSI peripheral.
//
//*****************************************************************************
static void
SpiEnableSSIDMAChannels(void)
{
    //
    // Enable the receive DMA channel.
    //
    MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.ui32DMARxChannel);

    //
    // We have to be sure that the SSI EOT interrupt is clear before we
    // initiate a DMA transaction.  If this is set, the transmitted packet
    // is truncated.  This is a workaround for a TM4C129 erratum but is
    // perfectly safe on other devices too.
    //
    MAP_SSIIntClear(sSpiInformation.sHwSettings.ui32SsiPort, SSI_TXEOT);

    //
    // Enable the transmit DMA channel.
    //
    MAP_uDMAChannelEnable(sSpiInformation.sHwSettings.ui32DMATxChannel);

    //
    // Enable DMA mode in the SSI peripheral.  We can unconditionally enable
    // both transmit and receive because, regardless of whether we intend
    // transmitting or receiving, we need to schedule both
    //
    MAP_SSIDMAEnable(sSpiInformation.sHwSettings.ui32SsiPort,
                     SSI_DMA_TX | SSI_DMA_RX);
}

//*****************************************************************************
//
// Schedule a single SPI receive DMA transaction (which requires a partner
// transmit transaction because, as the master, we drive the SPU clock).
// It is assumed that the size passed to this function has already been checked
// to ensure that it is smaller than the maximum size of a single transaction
// and also that the buffer passed via the pui8Data parameter has sufficient
// space to hold an additional "ui16Size" bytes of data.
//
// This function is asynchronous and returns immediately the DMA transactions
// have been enabled.  It does not block until the read has completed.
// Completion is indicated via the SSI uDMA interrupt.
//
//*****************************************************************************
static void
SpiReadData(uint8_t *pui8Data, uint16_t ui16Size)
{
    //
    // Disable both the transmit and receive DMA channels before we mess with
    // their setup.
    //
    SpiDisableSSIDMAChannels();

    //
    // Configure TX to generate the necessary clocks for read from the slave.
    // If we've been asked for 10 bytes or less, we set the transmit channel
    // to send a read header.  If more than 10 bytes, we send constant READ
    // values.
    //
    if(ui16Size <= sizeof(tSpiReadHeader))
    {
        //
        // We can send the whole read header.
        //
        MAP_uDMAChannelControlSet((sSpiInformation.sHwSettings.ui32DMATxChannel |
                                  UDMA_PRI_SELECT), (UDMA_SIZE_8 |
                                  UDMA_SRC_INC_8 | UDMA_DST_INC_NONE |
                                  UDMA_ARB_4));
    }
    else
    {
        //
        // We've been asked for more bytes than a single read header so
        // just send the first byte repeatedly.
        //
        MAP_uDMAChannelControlSet((sSpiInformation.sHwSettings.ui32DMATxChannel |
                                  UDMA_PRI_SELECT), (UDMA_SIZE_8 |
                                  UDMA_SRC_INC_NONE | UDMA_DST_INC_NONE |
                                  UDMA_ARB_4));
    }

    MAP_uDMAChannelTransferSet((sSpiInformation.sHwSettings.ui32DMATxChannel |
                                UDMA_PRI_SELECT), UDMA_MODE_BASIC,
                               (void *)tSpiReadHeader,
                               (void *)(sSpiInformation.sHwSettings.ui32SsiPort +
                                        SSI_O_DR), ui16Size);

    //
    // Configure RX to read the required number of bytes.
    //
    MAP_uDMAChannelControlSet((sSpiInformation.sHwSettings.ui32DMARxChannel |
                               UDMA_PRI_SELECT), (UDMA_SIZE_8 |
                              UDMA_SRC_INC_NONE | UDMA_DST_INC_8 | UDMA_ARB_1));

