timothybrown/TivaWare_GCC/cc3000/src/spi/spi-tm4c129.c
    MAP_uDMAChannelTransferSet((sSpiInformation.sHwSettings.ui32DMARxChannel |
                               UDMA_PRI_SELECT), UDMA_MODE_BASIC,
                               (void *)(sSpiInformation.sHwSettings.ui32SsiPort +
                                        SSI_O_DR),
                               (void *)pui8Data, ui16Size);

    //
    // Clean out any stale data that may be in the SSI receive FIFO.
    //
    SpiFlushRxFifo();

    //
    // Enable both the RX and TX channels here.  The transmit is also needed
    // here to ensure that the master (us) generates the clocks required to
    // read the required data from the slave.
    //
    SpiEnableSSIDMAChannels();
}

//*****************************************************************************
//
// Schedule a single SPI transmit DMA transaction (which requires a partner
// receive transaction to keep the receive FIFO flushed).  If the size passed
// is larger than can be handled in a single DMA transaction, the transaction
// is split into pieces and the first piece is scheduled here.
//
// This function is asynchronous and returns immediately the DMA transactions
// have been enabled.  It does not block until the transmit has completed.
// Completion of a transaction is indicated via the SSI uDMA interrupt and
// the driver state machine handles scheduling further pieces of a multi-
// transfer write.
//
//*****************************************************************************
static void
SpiWriteAsync(const uint8_t *pui8Data, uint16_t size)
{
    //
    // The uDMA channels must be disabled.
    //
    SpiDisableSSIDMAChannels();

    //
    // The uDMA controller can only transfer 1024 bytes in a single transaction
    // when using basic mode.  If asked for more than 1024 bytes, we split the
    // transaction into two.
    //
    if (size <= SPI_WINDOW_SIZE)
    {
        //
        // We can handle this request in a single DMA transaction.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_WRITE_EOT;
    }
    else
    {
        //
        // Remember that we've split this into two DMA transactions and set
        // up to send the first part.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_WRITE_FIRST_PORTION;

        //
        // Truncate the packet to the maximum size for now.
        //
        size = SPI_WINDOW_SIZE;
    }

    //
    // Set up a dummy RX DMA to keep the receive FIFO flushed.
    //
    MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.ui32DMARxChannel |
                              UDMA_PRI_SELECT, UDMA_SIZE_8 | UDMA_SRC_INC_NONE |
                              UDMA_DST_INC_NONE | UDMA_ARB_1);
    MAP_uDMAChannelTransferSet(
              (sSpiInformation.sHwSettings.ui32DMARxChannel |
               UDMA_PRI_SELECT), UDMA_MODE_BASIC,
              (void *)(sSpiInformation.sHwSettings.ui32SsiPort + SSI_O_DR),
              (void *)g_pui8Dummy, size );

    //
    // Start another DMA transfer to SSI TX.
    //
    MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.ui32DMATxChannel |
                              UDMA_PRI_SELECT, UDMA_SIZE_8 | UDMA_SRC_INC_8 |
                              UDMA_DST_INC_NONE | UDMA_ARB_4);

    MAP_uDMAChannelTransferSet(
              (sSpiInformation.sHwSettings.ui32DMATxChannel|UDMA_PRI_SELECT),
              UDMA_MODE_BASIC,(void *)pui8Data,
              (void *)(sSpiInformation.sHwSettings.ui32SsiPort + SSI_O_DR),
              size );

    //
    // Enable the SSI transmit and receive DMA channels.
    //
    SpiEnableSSIDMAChannels();
}

//*****************************************************************************
//
// This function, used during early initialization of the CC3000,  transmits a
// single packet via SPI and waits for the transmission to complete.  It is
// assumed that the packet to be transmitted is 1024 bytes or less in size and
// can be accommodated in a single DMA transaction.  On completion, the SSI
// EOT (used during normal operation to signal completion of a transmission)
// interrupt is left enabled.
//
//*****************************************************************************
static void
SpiWriteDataSynchronous(const uint8_t *pui8Data, uint16_t size)
{
    uint32_t ui32Status;

    //
    // This is a synchronous, polled write so we disable all SSI-related
    // interrupts.
    //
    MAP_SSIIntDisable(sSpiInformation.sHwSettings.ui32SsiPort, SSI_TXEOT);

    //
    // Perform the write.
    //
    SpiWriteAsync(pui8Data, size);

    //
    // Wait for the DMA transmit transaction to complete.
    //
    while(!SpiIsDMAStopped(sSpiInformation.sHwSettings.ui32DMATxChannel))
    {
        //
        // Kill time.
        //
    }

    //
    // Wait for the SSI FIFO to empty.
    //
    while(SSIBusy(SPI_BASE))
    {
        //
        // Kill time.
        //
    }

    //
    // Disable DMA in the SSI module.  If we don't do this, we can't clear the
    // DMA complete interrupt status bit (due to an erratum in the TM4C129).
    //
    SpiDisableSSIDMAChannels();

    //
    // Determine which interrupts are pending so that we can clear them.
    //
    ui32Status = MAP_SSIIntStatus(sSpiInformation.sHwSettings.ui32SsiPort,
                                  false);

    //
    // Clear all pending interrupts and also clear the DMA complete interrupts
    // even if they are not set.  It appears that TM4C129 can get into a state
    // where the DMA complete interrupts continue to fire even when the
    // interrupt status register shows those bits as clear.
    //
    MAP_SSIIntClear(sSpiInformation.sHwSettings.ui32SsiPort,
                    ui32Status | SSI_DMATX | SSI_DMARX);

    //
    // Re-enable the SSI interrupt.
    //
    MAP_SSIIntEnable(sSpiInformation.sHwSettings.ui32SsiPort, SSI_TXEOT);
}

//*****************************************************************************
//
// This function is called to start reception of data from the CC3000.  It
// schedules reception of 10 bytes from the device.  This contains the packet
// header and 5 bytes of payload data which is sufficient to determine the
// type of packet being received and the length of the remaining payload data.
//
// The function schedules reception and enables the DMA transactions then
// returns immediately.  Reception of the remainder of the packet is handled
// in the SPI interrupt handler when the header reception completes.
//
//*****************************************************************************
static void
SpiReadHeader(void)
{
    sSpiInformation.ui32SpiState = eSPI_STATE_READ_IRQ;

    SpiReadData(sSpiInformation.pRxPacket, PACKET_HEADER_LEN);
}

//*****************************************************************************
//
// Parse a previously-received packet header and, based on the content,
// schedule a further DMA transaction to receive the remainder of the bytes
// that the CC3000 is sending.  This function is called when the DMA
// transaction initiated by SpiReadHeader() completes.
//
// This function returns the number of bytes that are scheduled to be received
// in the next DMA transaction.  Note that, if the packet payload is larger
// than can be accommodated in a single DMA transaction, this value may be
// less than the payload size.
//
// It is assumed that the receive buffer at sSpiInformation.pRxPacket contains
// the first 10 bytes of an incoming packet before this function is called.
// These 10 bytes contain the SPI packet header and the HCI header.
//
// In cases where the received header contains a payload length larger than the
// available receive buffer size, the function does not schedule another DMA
// transaction but returns 0 and sets *pbError to true to indicate a problem.
//
//*****************************************************************************
long
SpiReadDataCont(bool *pbError)
{

    uint32_t ui32Count;
    uint8_t *pui8Buff;
    uint8_t ui8Type;

    //
    // Parameter sanity check.
    //
    ASSERT(pbError);

    //
    // Assume no error until we determine otherwise.
    //
    *pbError = false;

    //
    // Determine what type of packet we have
    //
    pui8Buff =  sSpiInformation.pRxPacket;
    ui32Count = 0;
    STREAM_TO_UINT8((char *)(pui8Buff + SPI_HEADER_SIZE),
                    HCI_PACKET_TYPE_OFFSET, ui8Type);

    //
    // What type of packet have we received?
    //
    switch(ui8Type)
    {
        //
        // The packet header indicates that this is a data packet.
        //
        case HCI_TYPE_DATA:
        {
            //
            // Determine the length of the data packet payload.  For a data
            // packet, the length is two bytes long allowing payloads of up
            // to 65535 bytes (although this implementation doesn't use
            // packets that long).
            //
            STREAM_TO_UINT16((char *)(pui8Buff + SPI_HEADER_SIZE),
                             HCI_DATA_LENGTH_OFFSET, ui32Count);

            //
            // Is this payload too long to be received into the buffer that
            // we have available to us?  If so, this indicates a software
            // error or a corruption in the received packet.  Either way, we
            // don't bother trying to receive the reset of the packet.  Note
            // that we need to round the packet size to the nearest higher
            // multiple of two because we've not considered padding yet.
            //
            if(((ui32Count + HCI_DATA_HEADER_SIZE +
                 SPI_HEADER_SIZE + 1) & ~1) >
               sSpiInformation.ui32RxBufferSize)
            {
                //
                // This must be a corrupted packet because the length we parsed
                // out of the header is larger than our receive buffer.
                //
                *pbError = true;
                return(0);
            }

            //
            // Can we get the whole payload in a single DMA transaction?
            //
            if (ui32Count >= SPI_WINDOW_SIZE)
            {
                //
                // No - receive as much as we can in the next transaction.
                //
                SpiReadData(pui8Buff + 10, SPI_WINDOW_SIZE);
                sSpiInformation.ui32SpiState = eSPI_STATE_READ_FIRST_PORTION;
            }
            else
            {
                //
                // Yes - the amount we have to read is strictly less than the
                // maximum DMA transaction size so we can read the whole
                // payload in one transaction, even if we need an additional
                // padding byte.
                //
                // Do we need that padding byte? Note that the payload length
                // is 2 bytes in a data packet but only one in an event packet
                // so the length we need to read is actually the length parsed
                // from the packet - we haven't already read the first payload
                // byte as we have in the (following) event case.  We've
                // already read 10 bytes so, to keep the whole packet an even
                // number of bytes, we need to read an even number of payload
                // bytes.
                //
                if(!((HEADERS_SIZE_EVNT + ui32Count) & 1))
                {
                    ui32Count++;
                }

