timothybrown/TivaWare_GCC/cc3000/src/spi/spi-tm4c129.c
                if(ui32Count)
                {
                    SpiReadData(pui8Buff + 10, ui32Count);
                }

                sSpiInformation.ui32SpiState = eSPI_STATE_READ_EOT;
            }
            break;
        }

        //
        // The packet header indicates that this is an event packet.
        //
        case HCI_TYPE_EVNT:
        {
            //
            // Determine the length of the event packet payload.  This is a
            // single byte in the event packet header.
            //
            STREAM_TO_UINT8((char *)(pui8Buff + SPI_HEADER_SIZE),
                            HCI_EVENT_LENGTH_OFFSET, ui32Count);

            //
            // Subtract one because we already read the first payload byte (or
            // a padding byte) when we read the initial 10 bytes.
            //
            ui32Count -= 1;

            //
            // Add a padding byte if needed.  All packets contain an even
            // number of bytes.
            //
            if((HEADERS_SIZE_EVNT + ui32Count) & 1)
            {
                ui32Count++;
            }

            //
            // Is this payload too long to be received into the buffer that
            // we have available to us?  If so, this indicates a software
            // error or corruption in the received header.  Either way, we
            // don't bother trying to receive the reset of the packet.
            //
            if((ui32Count + HEADERS_SIZE_EVNT) >
               sSpiInformation.ui32RxBufferSize)
            {
                //
                // This must be a corrupted packet because the length we parsed
                // out of the header is larger than our receive buffer.
                //
                *pbError = true;
                return(0);
            }

            //
            // If there is any more data to receive, schedule another DMA
            // transaction.
            //
            if(ui32Count)
            {
                SpiReadData(pui8Buff + 10, ui32Count);
            }

            sSpiInformation.ui32SpiState = eSPI_STATE_READ_EOT;
            break;
        }

        //
        // The packet type is unrecognized so don't receive anything more.
        //
        default:
        {
            *pbError = true;
            return(0);
        }
    }

    //
    // If we get here, we've scheduled a new DMA transaction to read the
    // remainder of the packet.  Tell the caller how many bytes they should
    // expect when that transaction completes.
    //
    return (ui32Count);
}

//*****************************************************************************
//
// Disable all interrupts associated with the SPI interface and the IRQ line.
//
//*****************************************************************************
static void
SpiDisableInterrupts(void)
{
    MAP_SSIIntDisable(sSpiInformation.sHwSettings.ui32SsiPort, SSI_TXEOT);
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32SsiPortInt);
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32PortInt);
}

//*****************************************************************************
//
// Re-enable the interrupts associated with the SPI interface and IRQ line.
//
//*****************************************************************************
void
SpiResumeSpi(void)
{
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32SsiPortInt);
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32PortInt);
    MAP_SSIIntEnable(sSpiInformation.sHwSettings.ui32SsiPort, SSI_TXEOT);
}

//*****************************************************************************
//
// A packet has been received.  Clean up, deasserting CS after the last bit has
// cleared the transmitter (remember, we need to transmit dummy data during
// receipt of a packet because we're the master and, hence, drive the SPI
// clock), then, if the packet isn't marked as bad, pass it up the stack for
// further processing.
//
//*****************************************************************************
void
SpiTriggerRxProcessing(bool bBadPacket)
{
    //
    // Tidy up at the end of receiving a packet.
    //
    SpiDisableInterrupts();
    while(SSIBusy(SPI_BASE));
    DEASSERT_CS();

    //
    // Move back to idle state so that we are ready to send or receive another
    // packet.
    //
    sSpiInformation.ui32SpiState = eSPI_STATE_IDLE;

    //
    // If this packet isn't marked as bad, pass it up the stack for processing.
    //
    if(!bBadPacket)
    {
        sSpiInformation.SPIRxHandler(sSpiInformation.pRxPacket +
                                     SPI_HEADER_SIZE);
    }
}

//*****************************************************************************
//
// This function is called whenever a SPI DMA transaction completes.  It
// schedules the next DMA transaction if one is required to receive additional
// packet data then, once no more data is to be read, passes the completed
// packet for processing via SpiTriggerRxProcessing().
//
//*****************************************************************************
static void
SpiContReadOperation(void)
{
    bool bError;

    //
    // Parse the header we already received then receive the remainder of the
    // packet.  This function returns 0 when the packet is complete or when
    // reception is aborted due to a packet error.  In cases of bad packets,
    // bError will be "true", otherwise it will be "false".
    //
    if (!SpiReadDataCont(&bError))
    {
        //
        // The packet was received successfully so pass it up the stack
        // for processing.
        //
        SpiTriggerRxProcessing(bError);
    }
}

//*****************************************************************************
//
// The interrupt handler for the GPIO input which is connected to the CC3000
// IRQ signal.  This line is used to signal asynchronous reception of data
// from the CC3000 or as a handshake for the CS line when sending commands to
// the CC3000.
//
// When the IRQ is asserted (pulled low) with CS high, this indicates that the
// CC3000 has information that we must read.  We assert CS and start the packet
// read here.
//
// When a command is being sent to the CC3000, we assert CS (with IRQ still
// high) then the CC3000 handshakes this by pulling IRQ low.  When we detect
// this transition, we start transmission of the command packet.
//
//*****************************************************************************
void
IntSpiGPIOHandler(void)
{
    uint32_t ui32Status;

    //
    // Which pin caused the interrupt?
    //
    ui32Status = SpiCleanGPIOISR();

    //
    // Was it our IRQ pin?
    //
    if(ui32Status & SPI_IRQ_PIN)
    {
        //
        // Yes - is this the first IRQ interrupt since powering up?
        //
        if (sSpiInformation.ui32SpiState == eSPI_STATE_POWERUP)
        {
            //
            // We received the first IRQ line edge after powering up the
            // part.  This is part of the startup sequence so change the state
            // to show that we received this.
            //
            sSpiInformation.ui32SpiState = eSPI_STATE_INITIALIZED;
        }
        else if (sSpiInformation.ui32SpiState == eSPI_STATE_IDLE)
        {
            //
            // We're idle so an IRQ interrupt indicates that the CC3000 has
            // data to send us.
            //
            sSpiInformation.ui32SpiState = eSPI_STATE_READ_IRQ;

            //
            // IRQ line asserted so handshake with CS and set up to
            // receive a packet header from the CC3000.
            //
            ASSERT_CS();

            //
            // Start receiving the 10 byte header from the CC3000.
            //
            SpiReadHeader();
        }
        else if (sSpiInformation.ui32SpiState == eSPI_STATE_WRITE_IRQ)
        {
            //
            // The CC3000 has responded to us lowering CS by handshaking with
            // its IRQ.  This indicates that we can now start transmitting the
            // command packet that we're waiting to send.
            //
            SpiWriteAsync(sSpiInformation.pTxPacket,
                          sSpiInformation.ui16TxPacketLength);
        }
    }
}

//*****************************************************************************
//
// The SPI peripheral interrupt handler.  This is called whenever we receive
// an End of Transmission interrupt from the SPI peripheral.  Because each
// SPI transaction, whether a read or a write, involves both a transmit and
// a simultaneous receive, we can use this single interrupt to indicate that
// any transaction has completed.
//
//*****************************************************************************
void
SpiIntHandler(void)
{
    uint16_t ui16Count;
    uint8_t *pui8Buff;
    uint32_t ui32Status;

    //
    // Get the active SSI interrupts.  Note that we grab the unmasked status
    // so that we can handle the TX DMA complete interrupt bit even though we
    // are not actually interrupting on it.  We interrupt on EOT instead of
    // TX DMA complete so that we can be sure we clear the EOT bit before we
    // initiate another TX DMA.  This is a workaround for a TM4C129 erratum
    // but is perfectly benign on other devices.
    //
    ui32Status = MAP_SSIIntStatus(sSpiInformation.sHwSettings.ui32SsiPort,
                                  false);

    //
    // Turn off the SSI transmit and receive DMA because we know both must have
    // completed for us to get the EOT interrupt.
    //
    SSIDMADisable(sSpiInformation.sHwSettings.ui32SsiPort,
                  SSI_DMA_TX | SSI_DMA_RX);

    //
    // Clear all pending SSI interrupts.
    //
    MAP_SSIIntClear(sSpiInformation.sHwSettings.ui32SsiPort, ui32Status);

    //
    // If the end of transmission interrupt hasn't fired, we're done.
    //
    if(!(ui32Status & SSI_TXEOT))
    {
        return;
    }

    pui8Buff =  sSpiInformation.pRxPacket;
    ui16Count = 0;

    //
    // Have we just finished reading the header on a received packet?
    //
    if (sSpiInformation.ui32SpiState == eSPI_STATE_READ_IRQ)
    {
        //
        // Read the remainder of the response.
        //
        SpiContReadOperation();
    }
    //
    // Have we just read the first portion of a packet that is too long for
    // a single DMA transaction and which has to be split into one or more
    // sections?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_READ_FIRST_PORTION)
    {
        //
        // Get the size of the packet payload from the header.  We assume
        // that this must be a data packet because an event packet cannot
        // have a payload longer than 255 bytes and, therefore, can always
        // be accommodated in a single DMA transaction.
        //
        STREAM_TO_UINT16((char *)(pui8Buff + SPI_HEADER_SIZE),
                         HCI_DATA_LENGTH_OFFSET, ui16Count);

        //
        // We have already read one maximum-DMA-sized chunk of the data
        // so subtract this from the payload length to get the number of
        // bytes we still need to read.
        //
        ui16Count -=SPI_WINDOW_SIZE;

        //
        // Pad the count of bytes to receive so that the incoming packet
        // always contains an odd number of bytes.
        //
        if (!((HEADERS_SIZE_EVNT + ui16Count) & 1))
        {
            ui16Count++;
        }

        //
        // Schedule a new DMA transaction to receive the remaining bytes
        // in the packet.  The assumption here is that no packet can be
        // longer than (10 + (2* SPI_WINDOW_SIZE)) bytes.
        //
        SpiReadData(sSpiInformation.pRxPacket + 10 + SPI_WINDOW_SIZE,
                    ui16Count);

        //
        // Remember that we're waiting for the last portion of the packet
        // to be read.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_READ_EOT;
    }
    //
    // Were we waiting for the last part of a received packet to arrive?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_READ_EOT)
    {
        //
        // Yes - we have the while packet now so go ahead and process it.
        //
        SpiTriggerRxProcessing(false);
    }
    //
    // Were we waiting for the last part of a transmitted packet to be sent?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_WRITE_EOT)
    {
        //
        // Raise CS to end the packet.
        //
        DEASSERT_CS();

        //
        // We're finished with this transaction so go back to idle.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_IDLE;
    }
    //
    // Have we just sent the first part of a large transmit packet?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_WRITE_FIRST_PORTION)
    {
        //
        // Yes - send the remainder of the packet.  The assumption, again, is
        // that no packet can be more than (10 + (2 * SPI_WINDOW_SIZE)) bytes
        // long.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_WRITE_EOT;

        //
        // Write the remainder of the packet data.
        //
        SpiWriteAsync(sSpiInformation.pTxPacket + SPI_WINDOW_SIZE,
                      sSpiInformation.ui16TxPacketLength - SPI_WINDOW_SIZE);
    }
}
